{
    "displayName":  "\u003cNAME\u003e - Defender Update Controls",
    "name":  "\u003cNAME\u003e - Defender Update Controls",
    "description":  "",
    "platforms":  "windows10",
    "technologies":  "mdm,microsoftSense",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "TemplateFamily":  "endpointSecurityAntivirus",
    "TemplateDisplayName":  "Defender Update controls",
    "TemplateId":  "e3f74c5a-a6de-411d-aef6-eb15628f3a0a_1",
    "TemplateDisplayVersion":  "Version 1",
    "templateReference":  {
                              "templateFamily":  "endpointSecurityAntivirus",
                              "templateDisplayName":  "Defender Update controls",
                              "templateDisplayVersion":  "Version 1",
                              "templateId":  "e3f74c5a-a6de-411d-aef6-eb15628f3a0a_1"
                          },
    "settings":  [
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_defender_configuration_engineupdateschannel",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "f7e1409d-9c85-4a3f-85a6-ad05cc8ccf13"
                                                                                      },
                                                 "auditRuleInformation":  null,
                                                 "choiceSettingValue":  {
                                                                            "children":  [

                                                                                         ],
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "useTemplateDefault":  false,
                                                                                                                  "settingValueTemplateId":  "afc8df70-7b19-4335-b200-bf4b7e098f67"
                                                                                                              },
                                                                            "value":  "device_vendor_msft_defender_configuration_engineupdateschannel_5"
                                                                        }
                                             },
                         "id":  "0"
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_defender_configuration_platformupdateschannel",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "e78b3ace-75d0-4aad-b3fa-4f49390d6483"
                                                                                      },
                                                 "auditRuleInformation":  null,
                                                 "choiceSettingValue":  {
                                                                            "children":  [

                                                                                         ],
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "useTemplateDefault":  false,
                                                                                                                  "settingValueTemplateId":  "d3b0d61a-bdc5-4507-84d0-5f2a4a3e11a5"
                                                                                                              },
                                                                            "value":  "device_vendor_msft_defender_configuration_platformupdateschannel_5"
                                                                        }
                                             },
                         "id":  "1"
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_defender_configuration_securityintelligenceupdateschannel",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "ba273649-e186-4377-89d5-87405bc9a87c"
                                                                                      },
                                                 "auditRuleInformation":  null,
                                                 "choiceSettingValue":  {
                                                                            "children":  [

                                                                                         ],
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "useTemplateDefault":  false,
                                                                                                                  "settingValueTemplateId":  "41ea06bf-e94a-482a-9aaa-7fd535fb4150"
                                                                                                              },
                                                                            "value":  "device_vendor_msft_defender_configuration_securityintelligenceupdateschannel_5"
                                                                        }
                                             },
                         "id":  "2"
                     }
                 ]
}
