{
    "displayName":  "\u003cNAME\u003e - Default Antivirus Policy",
    "name":  "\u003cNAME\u003e - Default Antivirus Policy",
    "description":  "",
    "platforms":  "windows10",
    "technologies":  "mdm,microsoftSense",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "TemplateFamily":  "endpointSecurityAntivirus",
    "TemplateDisplayName":  "Microsoft Defender Antivirus",
    "TemplateId":  "804339ad-1553-4478-a742-138fb5807418_1",
    "TemplateDisplayVersion":  "Version 1",
    "templateReference":  {
                              "templateFamily":  "endpointSecurityAntivirus",
                              "templateDisplayName":  "Microsoft Defender Antivirus",
                              "templateDisplayVersion":  "Version 1",
                              "templateId":  "804339ad-1553-4478-a742-138fb5807418_1"
                          },
    "settings":  [
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_defender_allowarchivescanning",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "7c5c9cde-f74d-4d11-904f-de4c27f72d89"
                                                                                      },
                                                 "auditRuleInformation":  null,
                                                 "choiceSettingValue":  {
                                                                            "children":  [

                                                                                         ],
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "useTemplateDefault":  false,
                                                                                                                  "settingValueTemplateId":  "9ead75d4-6f30-4bc5-8cc5-ab0f999d79f0"
                                                                                                              },
                                                                            "value":  "device_vendor_msft_policy_config_defender_allowarchivescanning_1"
                                                                        }
                                             },
                         "id":  "0"
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_defender_allowbehaviormonitoring",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "8eef615a-1aa0-46f4-a25a-12cbe65de5ab"
                                                                                      },
                                                 "auditRuleInformation":  null,
                                                 "choiceSettingValue":  {
                                                                            "children":  [

                                                                                         ],
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "useTemplateDefault":  false,
                                                                                                                  "settingValueTemplateId":  "905921da-95e2-4a10-9e30-fe5540002ce1"
                                                                                                              },
                                                                            "value":  "device_vendor_msft_policy_config_defender_allowbehaviormonitoring_1"
                                                                        }
                                             },
                         "id":  "1"
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_defender_allowcloudprotection",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "7da139f1-9b7e-407d-853a-c2e5037cdc70"
                                                                                      },
                                                 "auditRuleInformation":  null,
                                                 "choiceSettingValue":  {
                                                                            "children":  [

                                                                                         ],
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "useTemplateDefault":  false,
                                                                                                                  "settingValueTemplateId":  "16fe8afd-67be-4c50-8619-d535451a500c"
                                                                                                              },
                                                                            "value":  "device_vendor_msft_policy_config_defender_allowcloudprotection_1"
                                                                        }
                                             },
                         "id":  "2"
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_defender_allowemailscanning",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "b0d9ee81-de6a-4750-86d7-9397961c9852"
                                                                                      },
                                                 "auditRuleInformation":  null,
                                                 "choiceSettingValue":  {
                                                                            "children":  [

                                                                                         ],
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "useTemplateDefault":  false,
                                                                                                                  "settingValueTemplateId":  "fdf107fd-e13b-4507-9d8f-db4d93476af9"
                                                                                                              },
                                                                            "value":  "device_vendor_msft_policy_config_defender_allowemailscanning_1"
                                                                        }
                                             },
                         "id":  "3"
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_defender_allowfullscanremovabledrivescanning",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "fb36e70b-5bc9-488a-a949-8ea3ac1634d5"
                                                                                      },
                                                 "auditRuleInformation":  null,
                                                 "choiceSettingValue":  {
                                                                            "children":  [

                                                                                         ],
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "useTemplateDefault":  false,
                                                                                                                  "settingValueTemplateId":  "366c5727-629b-4a81-b50b-52f90282fa2c"
                                                                                                              },
                                                                            "value":  "device_vendor_msft_policy_config_defender_allowfullscanremovabledrivescanning_1"
                                                                        }
                                             },
                         "id":  "4"
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_defender_allowintrusionpreventionsystem",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "d47f06e2-5378-43f2-adbc-e924538f1512"
                                                                                      },
                                                 "auditRuleInformation":  null,
                                                 "choiceSettingValue":  {
                                                                            "children":  [

                                                                                         ],
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "useTemplateDefault":  false,
                                                                                                                  "settingValueTemplateId":  "03738a99-7065-44cb-ba1e-93530ed906a7"
                                                                                                              },
                                                                            "value":  "device_vendor_msft_policy_config_defender_allowintrusionpreventionsystem_1"
                                                                        }
                                             },
                         "id":  "5"
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_defender_allowioavprotection",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "fa06231d-aed4-4601-b631-3a37e85b62a0"
                                                                                      },
                                                 "auditRuleInformation":  null,
                                                 "choiceSettingValue":  {
                                                                            "children":  [

                                                                                         ],
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "useTemplateDefault":  false,
                                                                                                                  "settingValueTemplateId":  "df4e6cbd-f7ff-41c8-88cd-fa25264a237e"
                                                                                                              },
                                                                            "value":  "device_vendor_msft_policy_config_defender_allowioavprotection_1"
                                                                        }
                                             },
                         "id":  "6"
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_defender_allowrealtimemonitoring",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "f0790e28-9231-4d37-8f44-84bb47ca1b3e"
                                                                                      },
                                                 "auditRuleInformation":  null,
                                                 "choiceSettingValue":  {
                                                                            "children":  [

                                                                                         ],
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "useTemplateDefault":  false,
                                                                                                                  "settingValueTemplateId":  "0492c452-1069-4b91-9363-93b8e006ab12"
                                                                                                              },
                                                                            "value":  "device_vendor_msft_policy_config_defender_allowrealtimemonitoring_1"
                                                                        }
                                             },
                         "id":  "7"
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_defender_allowscriptscanning",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "000cf176-949c-4c08-a5d4-90ed43718db7"
                                                                                      },
                                                 "auditRuleInformation":  null,
                                                 "choiceSettingValue":  {
                                                                            "children":  [

                                                                                         ],
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "useTemplateDefault":  false,
                                                                                                                  "settingValueTemplateId":  "ab9e4320-c953-4067-ac9a-be2becd06b4a"
                                                                                                              },
                                                                            "value":  "device_vendor_msft_policy_config_defender_allowscriptscanning_1"
                                                                        }
                                             },
                         "id":  "8"
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_defender_allowuseruiaccess",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "0170a900-b0bc-4ccc-b7ce-dda9be49189b"
                                                                                      },
                                                 "auditRuleInformation":  null,
                                                 "choiceSettingValue":  {
                                                                            "children":  [

                                                                                         ],
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "useTemplateDefault":  false,
                                                                                                                  "settingValueTemplateId":  "4b6c9739-4449-4006-8e5f-3049136470ea"
                                                                                                              },
                                                                            "value":  "device_vendor_msft_policy_config_defender_allowuseruiaccess_1"
                                                                        }
                                             },
                         "id":  "9"
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_defender_avgcpuloadfactor",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "816cc03e-8f96-4cba-b14f-2658d031a79a"
                                                                                      },
                                                 "simpleSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "useTemplateDefault":  false,
                                                                                                                  "settingValueTemplateId":  "37195fb1-3743-4c8e-a0ce-b6fae6fa3acd"
                                                                                                              },
                                                                            "value":  50
                                                                        },
                                                 "auditRuleInformation":  null
                                             },
                         "id":  "10"
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_defender_checkforsignaturesbeforerunningscan",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "4fea56e3-7bb6-4ad3-88c6-e364dd2f97b9"
                                                                                      },
                                                 "auditRuleInformation":  null,
                                                 "choiceSettingValue":  {
                                                                            "children":  [

                                                                                         ],
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "useTemplateDefault":  false,
                                                                                                                  "settingValueTemplateId":  "010779d1-edd4-441d-8034-89ad57a863fe"
                                                                                                              },
                                                                            "value":  "device_vendor_msft_policy_config_defender_checkforsignaturesbeforerunningscan_1"
                                                                        }
                                             },
                         "id":  "11"
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_defender_cloudblocklevel",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "c7a37009-c16e-4145-84c8-89a8c121fb15"
                                                                                      },
                                                 "auditRuleInformation":  null,
                                                 "choiceSettingValue":  {
                                                                            "children":  [

                                                                                         ],
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "useTemplateDefault":  false,
                                                                                                                  "settingValueTemplateId":  "517b4e84-e933-42b9-b92f-00e640b1a82d"
                                                                                                              },
                                                                            "value":  "device_vendor_msft_policy_config_defender_cloudblocklevel_2"
                                                                        }
                                             },
                         "id":  "12"
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_defender_disablecatchupfullscan",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "f881b08c-f047-40d2-b7d9-3dde7ce9ef64"
                                                                                      },
                                                 "auditRuleInformation":  null,
                                                 "choiceSettingValue":  {
                                                                            "children":  [

                                                                                         ],
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "useTemplateDefault":  false,
                                                                                                                  "settingValueTemplateId":  "1b26092f-48c4-447b-99d4-e9c501542f1c"
                                                                                                              },
                                                                            "value":  "device_vendor_msft_policy_config_defender_disablecatchupfullscan_0"
                                                                        }
                                             },
                         "id":  "13"
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_defender_disablecatchupquickscan",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "dabf6781-9d5d-42da-822a-d4327aa2bdd1"
                                                                                      },
                                                 "auditRuleInformation":  null,
                                                 "choiceSettingValue":  {
                                                                            "children":  [

                                                                                         ],
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "useTemplateDefault":  false,
                                                                                                                  "settingValueTemplateId":  "d263ced7-0d23-4095-9326-99c8b3f5d35b"
                                                                                                              },
                                                                            "value":  "device_vendor_msft_policy_config_defender_disablecatchupquickscan_0"
                                                                        }
                                             },
                         "id":  "14"
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_defender_enablelowcpupriority",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "cdeb96cf-18f5-4477-a710-0ea9ecc618af"
                                                                                      },
                                                 "auditRuleInformation":  null,
                                                 "choiceSettingValue":  {
                                                                            "children":  [

                                                                                         ],
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "useTemplateDefault":  false,
                                                                                                                  "settingValueTemplateId":  "045a4a13-deee-4e24-9fe4-985c9357680d"
                                                                                                              },
                                                                            "value":  "device_vendor_msft_policy_config_defender_enablelowcpupriority_1"
                                                                        }
                                             },
                         "id":  "15"
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_defender_enablenetworkprotection",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "f53ab20e-8af6-48f5-9fa1-46863e1e517e"
                                                                                      },
                                                 "auditRuleInformation":  null,
                                                 "choiceSettingValue":  {
                                                                            "children":  [

                                                                                         ],
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "useTemplateDefault":  false,
                                                                                                                  "settingValueTemplateId":  "ee58fb51-9ae5-408b-9406-b92b643f388a"
                                                                                                              },
                                                                            "value":  "device_vendor_msft_policy_config_defender_enablenetworkprotection_1"
                                                                        }
                                             },
                         "id":  "16"
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_defender_puaprotection",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "c0135c2a-f802-44f4-9b71-b0b976411b8c"
                                                                                      },
                                                 "auditRuleInformation":  null,
                                                 "choiceSettingValue":  {
                                                                            "children":  [

                                                                                         ],
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "useTemplateDefault":  false,
                                                                                                                  "settingValueTemplateId":  "2d790211-18cb-4e32-b8cc-97407e2c0b45"
                                                                                                              },
                                                                            "value":  "device_vendor_msft_policy_config_defender_puaprotection_1"
                                                                        }
                                             },
                         "id":  "17"
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_defender_realtimescandirection",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "f5ff00a4-e5c7-44cf-a650-9c7619ff1561"
                                                                                      },
                                                 "auditRuleInformation":  null,
                                                 "choiceSettingValue":  {
                                                                            "children":  [

                                                                                         ],
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "useTemplateDefault":  false,
                                                                                                                  "settingValueTemplateId":  "6b4e3497-cfbb-4761-a152-de935bbf3f07"
                                                                                                              },
                                                                            "value":  "device_vendor_msft_policy_config_defender_realtimescandirection_1"
                                                                        }
                                             },
                         "id":  "18"
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_defender_scanparameter",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "27ca2652-46f3-4cc7-83f2-bf85ff722d84"
                                                                                      },
                                                 "auditRuleInformation":  null,
                                                 "choiceSettingValue":  {
                                                                            "children":  [

                                                                                         ],
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "useTemplateDefault":  false,
                                                                                                                  "settingValueTemplateId":  "70c8f42e-ee6a-4ef1-a070-cb0e9d472581"
                                                                                                              },
                                                                            "value":  "device_vendor_msft_policy_config_defender_scanparameter_2"
                                                                        }
                                             },
                         "id":  "19"
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_defender_allowonaccessprotection",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "afbc322b-083c-4281-8242-ebbb91398b41"
                                                                                      },
                                                 "auditRuleInformation":  null,
                                                 "choiceSettingValue":  {
                                                                            "children":  [

                                                                                         ],
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "useTemplateDefault":  false,
                                                                                                                  "settingValueTemplateId":  "ed077fee-9803-44f3-b045-aab34d8e6d52"
                                                                                                              },
                                                                            "value":  "device_vendor_msft_policy_config_defender_allowonaccessprotection_1"
                                                                        }
                                             },
                         "id":  "20"
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_defender_configuration_allownetworkprotectiondownlevel",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "d7342aaf-833d-4afc-92d6-e9621256a3cc"
                                                                                      },
                                                 "auditRuleInformation":  null,
                                                 "choiceSettingValue":  {
                                                                            "children":  [

                                                                                         ],
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "useTemplateDefault":  false,
                                                                                                                  "settingValueTemplateId":  "248fdbe0-e0c9-4b47-bce1-95c8058736fb"
                                                                                                              },
                                                                            "value":  "device_vendor_msft_defender_configuration_allownetworkprotectiondownlevel_0"
                                                                        }
                                             },
                         "id":  "21"
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_defender_configuration_allowdatagramprocessingonwinserver",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "69fa7ce4-6cd8-4699-aff7-024a889c25ce"
                                                                                      },
                                                 "auditRuleInformation":  null,
                                                 "choiceSettingValue":  {
                                                                            "children":  [

                                                                                         ],
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "useTemplateDefault":  false,
                                                                                                                  "settingValueTemplateId":  "0333679d-3b8a-4b51-9f8e-bba39b263712"
                                                                                                              },
                                                                            "value":  "device_vendor_msft_defender_configuration_allowdatagramprocessingonwinserver_0"
                                                                        }
                                             },
                         "id":  "22"
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_defender_configuration_disablednsovertcpparsing",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "522811d2-c99e-4e6d-9cf5-36779498aec6"
                                                                                      },
                                                 "auditRuleInformation":  null,
                                                 "choiceSettingValue":  {
                                                                            "children":  [

                                                                                         ],
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "useTemplateDefault":  false,
                                                                                                                  "settingValueTemplateId":  "19e3f074-15d5-43ec-8718-2e09aee0a972"
                                                                                                              },
                                                                            "value":  "device_vendor_msft_defender_configuration_disablednsovertcpparsing_0"
                                                                        }
                                             },
                         "id":  "23"
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_defender_configuration_disablehttpparsing",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "662abd23-4077-4b4b-a305-7f104ef28beb"
                                                                                      },
                                                 "auditRuleInformation":  null,
                                                 "choiceSettingValue":  {
                                                                            "children":  [

                                                                                         ],
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "useTemplateDefault":  false,
                                                                                                                  "settingValueTemplateId":  "d4a20dd5-8cc2-4b7e-ac84-6f76fde3cfc9"
                                                                                                              },
                                                                            "value":  "device_vendor_msft_defender_configuration_disablehttpparsing_0"
                                                                        }
                                             },
                         "id":  "24"
                     }
                 ]
}
