{
    "displayName":  "\u003cNAME\u003e - Windows LAPS",
    "name":  "\u003cNAME\u003e - Windows LAPS",
    "description":  "",
    "platforms":  "windows10",
    "technologies":  "mdm",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "TemplateFamily":  "endpointSecurityAccountProtection",
    "TemplateDisplayName":  "Local admin password solution (Windows LAPS)",
    "TemplateId":  "adc46e5a-f4aa-4ff6-aeff-4f27bc525796_1",
    "TemplateDisplayVersion":  "Version 1",
    "templateReference":  {
                              "templateFamily":  "endpointSecurityAccountProtection",
                              "templateDisplayName":  "Local admin password solution (Windows LAPS)",
                              "templateDisplayVersion":  "Version 1",
                              "templateId":  "adc46e5a-f4aa-4ff6-aeff-4f27bc525796_1"
                          },
    "settings":  [
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_laps_policies_backupdirectory",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "a3270f64-e493-499d-8900-90290f61ed8a"
                                                                                      },
                                                 "auditRuleInformation":  null,
                                                 "choiceSettingValue":  {
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                                                 "settingDefinitionId":  "device_vendor_msft_laps_policies_passwordagedays_aad",
                                                                                                 "settingInstanceTemplateReference":  null,
                                                                                                 "simpleSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "useTemplateDefault":  false,
                                                                                                                                                                  "settingValueTemplateId":  "4d90f03d-e14c-43c4-86da-681da96a2f92"
                                                                                                                                                              },
                                                                                                                            "value":  7
                                                                                                                        },
                                                                                                 "auditRuleInformation":  null
                                                                                             }
                                                                                         ],
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "useTemplateDefault":  false,
                                                                                                                  "settingValueTemplateId":  "4d90f03d-e14c-43c4-86da-681da96a2f92"
                                                                                                              },
                                                                            "value":  "device_vendor_msft_laps_policies_backupdirectory_1"
                                                                        }
                                             },
                         "id":  "0"
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_laps_policies_passwordcomplexity",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "8a7459e8-1d1c-458a-8906-7b27d216de52"
                                                                                      },
                                                 "auditRuleInformation":  null,
                                                 "choiceSettingValue":  {
                                                                            "children":  [

                                                                                         ],
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "useTemplateDefault":  false,
                                                                                                                  "settingValueTemplateId":  "aa883ab5-625e-4e3b-b830-a37a4bb8ce01"
                                                                                                              },
                                                                            "value":  "device_vendor_msft_laps_policies_passwordcomplexity_5"
                                                                        }
                                             },
                         "id":  "1"
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_laps_policies_postauthenticationactions",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "d9282eb1-d187-42ae-b366-7081f32dcfff"
                                                                                      },
                                                 "auditRuleInformation":  null,
                                                 "choiceSettingValue":  {
                                                                            "children":  [

                                                                                         ],
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "useTemplateDefault":  false,
                                                                                                                  "settingValueTemplateId":  "68ff4f78-baa8-4b32-bf3d-5ad5566d8142"
                                                                                                              },
                                                                            "value":  "device_vendor_msft_laps_policies_postauthenticationactions_3"
                                                                        }
                                             },
                         "id":  "2"
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_laps_policies_postauthenticationresetdelay",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "a9e21166-4055-4042-9372-efaf3ef41868"
                                                                                      },
                                                 "simpleSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "useTemplateDefault":  false,
                                                                                                                  "settingValueTemplateId":  "0deb6aee-8dac-40c4-a9dd-c3718e5c1d52"
                                                                                                              },
                                                                            "value":  8
                                                                        },
                                                 "auditRuleInformation":  null
                                             },
                         "id":  "3"
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_laps_policies_automaticaccountmanagementenabled",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "0d70f6fb-8f35-4fba-8ada-494b8a478703"
                                                                                      },
                                                 "auditRuleInformation":  null,
                                                 "choiceSettingValue":  {
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "device_vendor_msft_laps_policies_automaticaccountmanagementenableaccount",
                                                                                                 "settingInstanceTemplateReference":  null,
                                                                                                 "auditRuleInformation":  null,
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "children":  [

                                                                                                                                         ],
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "useTemplateDefault":  false,
                                                                                                                                                                  "settingValueTemplateId":  "5db30960-1e02-4100-9e2c-a2212596b054"
                                                                                                                                                              },
                                                                                                                            "value":  "device_vendor_msft_laps_policies_automaticaccountmanagementenableaccount_true"
                                                                                                                        }
                                                                                             },
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "device_vendor_msft_laps_policies_automaticaccountmanagementtarget",
                                                                                                 "settingInstanceTemplateReference":  null,
                                                                                                 "auditRuleInformation":  null,
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "children":  [

                                                                                                                                         ],
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "useTemplateDefault":  false,
                                                                                                                                                                  "settingValueTemplateId":  "5db30960-1e02-4100-9e2c-a2212596b054"
                                                                                                                                                              },
                                                                                                                            "value":  "device_vendor_msft_laps_policies_automaticaccountmanagementtarget_0"
                                                                                                                        }
                                                                                             },
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "device_vendor_msft_laps_policies_automaticaccountmanagementrandomizename",
                                                                                                 "settingInstanceTemplateReference":  null,
                                                                                                 "auditRuleInformation":  null,
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "children":  [

                                                                                                                                         ],
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "useTemplateDefault":  false,
                                                                                                                                                                  "settingValueTemplateId":  "5db30960-1e02-4100-9e2c-a2212596b054"
                                                                                                                                                              },
                                                                                                                            "value":  "device_vendor_msft_laps_policies_automaticaccountmanagementrandomizename_true"
                                                                                                                        }
                                                                                             },
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                                                 "settingDefinitionId":  "device_vendor_msft_laps_policies_automaticaccountmanagementnameorprefix",
                                                                                                 "settingInstanceTemplateReference":  null,
                                                                                                 "simpleSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "useTemplateDefault":  false,
                                                                                                                                                                  "settingValueTemplateId":  "5db30960-1e02-4100-9e2c-a2212596b054"
                                                                                                                                                              },
                                                                                                                            "value":  "LapsAdmin-"
                                                                                                                        },
                                                                                                 "auditRuleInformation":  null
                                                                                             }
                                                                                         ],
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "useTemplateDefault":  false,
                                                                                                                  "settingValueTemplateId":  "5db30960-1e02-4100-9e2c-a2212596b054"
                                                                                                              },
                                                                            "value":  "device_vendor_msft_laps_policies_automaticaccountmanagementenabled_true"
                                                                        }
                                             },
                         "id":  "4"
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_laps_policies_passwordlength",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "da7a1dbd-caf7-4341-ab63-ece6f994ff02"
                                                                                      },
                                                 "simpleSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "useTemplateDefault":  false,
                                                                                                                  "settingValueTemplateId":  "d08f1266-5345-4f53-8ae1-4c20e6cb5ec9"
                                                                                                              },
                                                                            "value":  16
                                                                        },
                                                 "auditRuleInformation":  null
                                             },
                         "id":  "5"
                     }
                 ]
}
