{
    "displayName":  "\u003cNAME\u003e - Local Admin//Replace with LAPS Admin.",
    "name":  "\u003cNAME\u003e - Local Admin//Replace with LAPS Admin.",
    "description":  "",
    "platforms":  "windows10",
    "technologies":  "mdm",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "TemplateFamily":  "endpointSecurityAccountProtection",
    "TemplateDisplayName":  "Local user group membership",
    "TemplateId":  "22968f54-45fa-486c-848e-f8224aa69772_1",
    "TemplateDisplayVersion":  "Version 1",
    "templateReference":  {
                              "templateFamily":  "endpointSecurityAccountProtection",
                              "templateDisplayName":  "Local user group membership",
                              "templateDisplayVersion":  "Version 1",
                              "templateId":  "22968f54-45fa-486c-848e-f8224aa69772_1"
                          },
    "settings":  {
                     "settingInstance":  {
                                             "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                             "settingDefinitionId":  "device_vendor_msft_policy_config_localusersandgroups_configure",
                                             "settingInstanceTemplateReference":  {
                                                                                      "settingInstanceTemplateId":  "de06bec1-4852-48a0-9799-cf7b85992d45"
                                                                                  },
                                             "auditRuleInformation":  null,
                                             "groupSettingCollectionValue":  [
                                                                                 {
                                                                                     "settingValueTemplateReference":  null,
                                                                                     "children":  [
                                                                                                      {
                                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                                                                                          "settingDefinitionId":  "device_vendor_msft_policy_config_localusersandgroups_configure_groupconfiguration_accessgroup",
                                                                                                          "settingInstanceTemplateReference":  null,
                                                                                                          "auditRuleInformation":  null,
                                                                                                          "groupSettingCollectionValue":  [
                                                                                                                                              {
                                                                                                                                                  "settingValueTemplateReference":  null,
                                                                                                                                                  "children":  [
                                                                                                                                                                   {
                                                                                                                                                                       "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingCollectionInstance",
                                                                                                                                                                       "settingDefinitionId":  "device_vendor_msft_policy_config_localusersandgroups_configure_groupconfiguration_accessgroup_desc",
                                                                                                                                                                       "settingInstanceTemplateReference":  null,
                                                                                                                                                                       "auditRuleInformation":  null,
                                                                                                                                                                       "choiceSettingCollectionValue":  "System.Collections.Hashtable"
                                                                                                                                                                   },
                                                                                                                                                                   {
                                                                                                                                                                       "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                                                                                       "settingDefinitionId":  "device_vendor_msft_policy_config_localusersandgroups_configure_groupconfiguration_accessgroup_action",
                                                                                                                                                                       "settingInstanceTemplateReference":  null,
                                                                                                                                                                       "auditRuleInformation":  null,
                                                                                                                                                                       "choiceSettingValue":  "System.Collections.Hashtable"
                                                                                                                                                                   },
                                                                                                                                                                   {
                                                                                                                                                                       "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                                                                                       "settingDefinitionId":  "device_vendor_msft_policy_config_localusersandgroups_configure_groupconfiguration_accessgroup_userselectiontype",
                                                                                                                                                                       "settingInstanceTemplateReference":  null,
                                                                                                                                                                       "auditRuleInformation":  null,
                                                                                                                                                                       "choiceSettingValue":  "System.Collections.Hashtable"
                                                                                                                                                                   }
                                                                                                                                                               ]
                                                                                                                                              }
                                                                                                                                          ]
                                                                                                      }
                                                                                                  ]
                                                                                 }
                                                                             ]
                                         },
                     "id":  "0"
                 }
}
