{
    "displayName":  "\u003cNAME\u003e - Detection \u0026 Response Policy",
    "name":  "\u003cNAME\u003e - Detection \u0026 Response Policy",
    "description":  "",
    "platforms":  "windows10",
    "technologies":  "mdm,microsoftSense",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "TemplateFamily":  "endpointSecurityEndpointDetectionAndResponse",
    "TemplateDisplayName":  "Endpoint detection and response",
    "TemplateId":  "0385b795-0f2f-44ac-8602-9f65bf6adede_1",
    "TemplateDisplayVersion":  "Version 1",
    "templateReference":  {
                              "templateFamily":  "endpointSecurityEndpointDetectionAndResponse",
                              "templateDisplayName":  "Endpoint detection and response",
                              "templateDisplayVersion":  "Version 1",
                              "templateId":  "0385b795-0f2f-44ac-8602-9f65bf6adede_1"
                          },
    "settings":  [
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_windowsadvancedthreatprotection_configuration_samplesharing",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "6998c81e-2814-4f5e-b492-a6159128a97b"
                                                                                      },
                                                 "auditRuleInformation":  null,
                                                 "choiceSettingValue":  {
                                                                            "children":  [

                                                                                         ],
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "useTemplateDefault":  false,
                                                                                                                  "settingValueTemplateId":  "f72c326c-7c5b-4224-b890-0b9b54522bd9"
                                                                                                              },
                                                                            "value":  "device_vendor_msft_windowsadvancedthreatprotection_configuration_samplesharing_1"
                                                                        }
                                             },
                         "id":  "0"
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_windowsadvancedthreatprotection_configuration_telemetryreportingfrequency",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "03de6095-07c4-4f35-be38-c1cd3bae4484"
                                                                                      },
                                                 "auditRuleInformation":  null,
                                                 "choiceSettingValue":  {
                                                                            "children":  [

                                                                                         ],
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "useTemplateDefault":  false,
                                                                                                                  "settingValueTemplateId":  "350b0bea-b67b-43d4-9a04-c796edb961fd"
                                                                                                              },
                                                                            "value":  "device_vendor_msft_windowsadvancedthreatprotection_configuration_telemetryreportingfrequency_1"
                                                                        }
                                             },
                         "id":  "1"
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_windowsadvancedthreatprotection_configurationtype",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "23ab0ea3-1b12-429a-8ed0-7390cf699160"
                                                                                      },
                                                 "auditRuleInformation":  null,
                                                 "choiceSettingValue":  {
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                                                 "settingDefinitionId":  "device_vendor_msft_windowsadvancedthreatprotection_onboarding",
                                                                                                 "settingInstanceTemplateReference":  null,
                                                                                                 "simpleSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSecretSettingValue",
                                                                                                                            "valueState":  "encryptedValueToken",
                                                                                                                            "settingValueTemplateReference":  null,
                                                                                                                            "value":  "bc1bc773-a769-4930-8aa2-aa1051fb5b42"
                                                                                                                        },
                                                                                                 "auditRuleInformation":  null
                                                                                             }
                                                                                         ],
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "useTemplateDefault":  false,
                                                                                                                  "settingValueTemplateId":  "e5c7c98c-c854-4140-836e-bd22db59d651"
                                                                                                              },
                                                                            "value":  "device_vendor_msft_windowsadvancedthreatprotection_configurationtype_onboard"
                                                                        }
                                             },
                         "id":  "2"
                     }
                 ]
}
