{
    "deletedDateTime":  null,
    "conditions":  {
                       "clientAppTypes":  [
                                              "all"
                                          ],
                       "times":  null,
                       "devices":  null,
                       "applications":  {
                                            "applicationFilter":  null,
                                            "includeAuthenticationContextClassReferences":  [

                                                                                            ],
                                            "excludeApplications":  [

                                                                    ],
                                            "includeApplications":  [
                                                                        "MicrosoftAdminPortals"
                                                                    ],
                                            "includeUserActions":  [

                                                                   ]
                                        },
                       "deviceStates":  null,
                       "clientApplications":  null,
                       "userRiskLevels":  [

                                          ],
                       "users":  {
                                     "excludeGroups":  [

                                                       ],
                                     "excludeUsers":  [

                                                      ],
                                     "includeGuestsOrExternalUsers":  null,
                                     "includeRoles":  [
                                                          "9b895d92-2cd3-44c7-9d02-a6ac2d5ea5c3",
                                                          "c4e39bd9-1100-46d3-8c65-fb160da0071f",
                                                          "b0f54661-2d74-4c50-afa3-1ec803f12efe",
                                                          "158c047a-c907-4556-b7ef-446551a6b5f7",
                                                          "b1be1c3e-b65d-4f19-8427-f6fa0d97feb9",
                                                          "29232cdf-9323-42fd-ade2-1d097af3e4de",
                                                          "62e90394-69f5-4237-9190-012177145e10",
                                                          "f2ef992c-3afb-46b9-b7cf-a126ee74c451",
                                                          "729827e3-9c14-49f7-bb1b-9608f156bbb8",
                                                          "966707d0-3269-4727-9be2-8c3a10f19b9d",
                                                          "7be44c8a-adaf-4e2a-84d6-ab2649e08a13",
                                                          "e8611ab8-c189-46e8-94e1-60213ab1f814",
                                                          "194ae4cb-b126-40b2-bd5b-6091b380977d",
                                                          "f28a1f50-f6e7-4571-818b-6a12f2af6b6c",
                                                          "fe930be7-5e62-47db-91af-98c3a49a38b1"
                                                      ],
                                     "excludeRoles":  [

                                                      ],
                                     "includeUsers":  [

                                                      ],
                                     "includeGroups":  [

                                                       ],
                                     "excludeGuestsOrExternalUsers":  null
                                 },
                       "signInRiskLevels":  [

                                            ],
                       "platforms":  null,
                       "locations":  null
                   },
    "displayName":  "1.2 Require: Multifactor Authentication for Microsoft Admin Portals",
    "grantControls":  {
                          "authenticationStrength":  {
                                                         "allowedCombinations":  [
                                                                                     "windowsHelloForBusiness",
                                                                                     "fido2",
                                                                                     "x509CertificateMultiFactor",
                                                                                     "deviceBasedPush",
                                                                                     "temporaryAccessPassOneTime",
                                                                                     "temporaryAccessPassMultiUse",
                                                                                     "password,microsoftAuthenticatorPush",
                                                                                     "password,softwareOath",
                                                                                     "password,hardwareOath",
                                                                                     "password,sms",
                                                                                     "password,voice",
                                                                                     "federatedMultiFactor",
                                                                                     "microsoftAuthenticatorPush,federatedSingleFactor",
                                                                                     "softwareOath,federatedSingleFactor",
                                                                                     "hardwareOath,federatedSingleFactor",
                                                                                     "sms,federatedSingleFactor",
                                                                                     "voice,federatedSingleFactor"
                                                                                 ],
                                                         "requirementsSatisfied":  "mfa",
                                                         "createdDateTime":  "\/Date(1638345600000)\/",
                                                         "policyType":  "builtIn",
                                                         "id":  "00000000-0000-0000-0000-000000000002",
                                                         "modifiedDateTime":  "\/Date(1638345600000)\/",
                                                         "displayName":  "Multifactor authentication",
                                                         "description":  "Combinations of methods that satisfy strong authentication, such as a password + SMS",
                                                         "combinationConfigurations":  [

                                                                                       ],
                                                         "combinationConfigurations@odata.context":  "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies(\u0027c56a0b15-8451-49f3-bc25-322608fc2efe\u0027)/grantControls/authenticationStrength/combinationConfigurations"
                                                     },
                          "operator":  "OR",
                          "authenticationStrength@odata.context":  "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies(\u0027c56a0b15-8451-49f3-bc25-322608fc2efe\u0027)/grantControls/authenticationStrength/$entity",
                          "termsOfUse":  [

                                         ],
                          "customAuthenticationFactors":  [

                                                          ],
                          "builtInControls":  [

                                              ]
                      },
    "templateId":  null,
    "partialEnablementStrategy":  null,
    "id":  "c56a0b15-8451-49f3-bc25-322608fc2efe",
    "modifiedDateTime":  null,
    "state":  "disabled",
    "sessionControls":  {
                            "signInFrequency":  {
                                                    "isEnabled":  true,
                                                    "type":  "hours",
                                                    "authenticationType":  "primaryAndSecondaryAuthentication",
                                                    "frequencyInterval":  "timeBased",
                                                    "value":  2
                                                },
                            "disableResilienceDefaults":  null,
                            "cloudAppSecurity":  null,
                            "secureSignInSession":  null,
                            "continuousAccessEvaluation":  null,
                            "applicationEnforcedRestrictions":  null,
                            "persistentBrowser":  null
                        },
    "createdDateTime":  "\/Date(1763121786696)\/"
}
