{
    "displayName":  "\u003cNAME\u003e - Attack Surface Reduction Rules Policy",
    "name":  "\u003cNAME\u003e - Attack Surface Reduction Rules Policy",
    "description":  "",
    "platforms":  "windows10",
    "technologies":  "mdm,microsoftSense",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "TemplateFamily":  "endpointSecurityAttackSurfaceReduction",
    "TemplateDisplayName":  "Attack Surface Reduction Rules",
    "TemplateId":  "e8c053d6-9f95-42b1-a7f1-ebfd71c67a4b_1",
    "TemplateDisplayVersion":  "Version 1",
    "templateReference":  {
                              "templateFamily":  "endpointSecurityAttackSurfaceReduction",
                              "templateDisplayName":  "Attack Surface Reduction Rules",
                              "templateDisplayVersion":  "Version 1",
                              "templateId":  "e8c053d6-9f95-42b1-a7f1-ebfd71c67a4b_1"
                          },
    "settings":  [
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_defender_attacksurfacereductionrules",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "19600663-e264-4c02-8f55-f2983216d6d7"
                                                                                      },
                                                 "auditRuleInformation":  null,
                                                 "groupSettingCollectionValue":  [
                                                                                     {
                                                                                         "settingValueTemplateReference":  null,
                                                                                         "children":  [
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockexecutionofpotentiallyobfuscatedscripts",
                                                                                                              "settingInstanceTemplateReference":  {
                                                                                                                                                       "settingInstanceTemplateId":  "e416083e-05e3-4237-b8ec-a6ad49c4571e"
                                                                                                                                                   },
                                                                                                              "auditRuleInformation":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "children":  [

                                                                                                                                                      ],
                                                                                                                                         "settingValueTemplateReference":  {
                                                                                                                                                                               "useTemplateDefault":  false,
                                                                                                                                                                               "settingValueTemplateId":  "8b17ebce-496f-4b58-9d89-dd1c3861de39"
                                                                                                                                                                           },
                                                                                                                                         "value":  "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockexecutionofpotentiallyobfuscatedscripts_block"
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockofficecommunicationappfromcreatingchildprocesses",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "auditRuleInformation":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "children":  [

                                                                                                                                                      ],
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockofficecommunicationappfromcreatingchildprocesses_off"
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockallofficeapplicationsfromcreatingchildprocesses",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "auditRuleInformation":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "children":  [

                                                                                                                                                      ],
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockallofficeapplicationsfromcreatingchildprocesses_block"
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockwin32apicallsfromofficemacros",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "auditRuleInformation":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "children":  [

                                                                                                                                                      ],
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockwin32apicallsfromofficemacros_block"
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockexecutablefilesrunningunlesstheymeetprevalenceagetrustedlistcriterion",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "auditRuleInformation":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "children":  [

                                                                                                                                                      ],
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockexecutablefilesrunningunlesstheymeetprevalenceagetrustedlistcriterion_block"
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockjavascriptorvbscriptfromlaunchingdownloadedexecutablecontent",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "auditRuleInformation":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "children":  [

                                                                                                                                                      ],
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockjavascriptorvbscriptfromlaunchingdownloadedexecutablecontent_block"
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockuntrustedunsignedprocessesthatrunfromusb",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "auditRuleInformation":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "children":  [

                                                                                                                                                      ],
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockuntrustedunsignedprocessesthatrunfromusb_block"
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockadobereaderfromcreatingchildprocesses",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "auditRuleInformation":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "children":  [

                                                                                                                                                      ],
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockadobereaderfromcreatingchildprocesses_block"
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockcredentialstealingfromwindowslocalsecurityauthoritysubsystem",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "auditRuleInformation":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "children":  [

                                                                                                                                                      ],
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockcredentialstealingfromwindowslocalsecurityauthoritysubsystem_block"
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockwebshellcreationforservers",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "auditRuleInformation":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "children":  [

                                                                                                                                                      ],
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockwebshellcreationforservers_audit"
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockabuseofexploitedvulnerablesigneddrivers",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "auditRuleInformation":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "children":  [

                                                                                                                                                      ],
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockabuseofexploitedvulnerablesigneddrivers_block"
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockpersistencethroughwmieventsubscription",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "auditRuleInformation":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "children":  [

                                                                                                                                                      ],
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockpersistencethroughwmieventsubscription_block"
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockuseofcopiedorimpersonatedsystemtools",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "auditRuleInformation":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "children":  [

                                                                                                                                                      ],
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockuseofcopiedorimpersonatedsystemtools_block"
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockofficeapplicationsfrominjectingcodeintootherprocesses",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "auditRuleInformation":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "children":  [

                                                                                                                                                      ],
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockofficeapplicationsfrominjectingcodeintootherprocesses_block"
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_useadvancedprotectionagainstransomware",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "auditRuleInformation":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "children":  [

                                                                                                                                                      ],
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_useadvancedprotectionagainstransomware_block"
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockprocesscreationsfrompsexecandwmicommands",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "auditRuleInformation":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "children":  [

                                                                                                                                                      ],
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockprocesscreationsfrompsexecandwmicommands_block"
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockrebootingmachineinsafemode",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "auditRuleInformation":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "children":  [

                                                                                                                                                      ],
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockrebootingmachineinsafemode_audit"
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockexecutablecontentfromemailclientandwebmail",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "auditRuleInformation":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "children":  [

                                                                                                                                                      ],
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockexecutablecontentfromemailclientandwebmail_block"
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockofficeapplicationsfromcreatingexecutablecontent",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "auditRuleInformation":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "children":  [

                                                                                                                                                      ],
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockofficeapplicationsfromcreatingexecutablecontent_block"
                                                                                                                                     }
                                                                                                          }
                                                                                                      ]
                                                                                     }
                                                                                 ]
                                             },
                         "id":  "0"
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_defender_enablecontrolledfolderaccess",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "settingInstanceTemplateId":  "78c83b32-56c0-445a-932a-872d69af6e49"
                                                                                      },
                                                 "auditRuleInformation":  null,
                                                 "choiceSettingValue":  {
                                                                            "children":  [

                                                                                         ],
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "useTemplateDefault":  false,
                                                                                                                  "settingValueTemplateId":  "e57db701-c3c6-4264-ab50-7896cb90dfd6"
                                                                                                              },
                                                                            "value":  "device_vendor_msft_policy_config_defender_enablecontrolledfolderaccess_2"
                                                                        }
                                             },
                         "id":  "1"
                     }
                 ]
}
